if (!global.engineIntervals) global.engineIntervals = new Map();

module.exports.config = {
  name: "توسيع المجال",
  version: "1.0.0",
  hasPermssion: 2,
  credits: "Replit Agent",
  description: "يرسل رسالة كل 30 ثانية (تفعيل/ايقاف)",
  commandCategory: "نظام",
  prefix: true,
  usages: "[تفعيل/ايقاف]",
  cooldowns: 5
};

console.log("DEBUG: Loaded 'محرك' command config.");

module.exports.run = async function ({ api, event, args }) {
  const { threadID, senderID } = event;
  const action = args[0]?.toLowerCase();

  // Admin Check
  const admins = (global.config.ADMINBOT || []).map(String);
  if (!admins.includes(String(senderID))) {
    return api.sendMessage("❌ هذا الأمر مخصص لأدمن البوت فقط.", threadID);
  }

  // Handle "ايقاف" or "stop" or "off"
  if (action === "ايقاف" || action === "off" || action === "stop") {
    if (global.engineIntervals.has(threadID)) {
      clearInterval(global.engineIntervals.get(threadID));
      global.engineIntervals.delete(threadID);
      return api.sendMessage("السكينة تحل على المجموعة....", threadID);
    } else {
      return api.sendMessage("⚠️ المجال غير موجود في هذه المجموعة.", threadID);
    }
  }

  // Handle "تفعيل" or "on" or "start"
  if (action === "تفعيل" || action === "on" || action === "start") {
    if (global.engineIntervals.has(threadID)) {
      return api.sendMessage("⚠️ هذه المجموعة تحت تأثير توسيع المجال بالفعل بالفعل.", threadID);
    }

    api.sendMessage("توسيع المجال: چنة آلڪويپو 🪉🪽", threadID);

    const interval = setInterval(() => {
      api.sendMessage(`👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـفـ👑ـ👑ـ👑ـ🪽ـيـ👑ـ👑ـ👑ـ🪽ـنـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـكـ👑ـ👑ـ👑ـ🪽ـجـ👑ـ👑ـ👑ـ🪽ـحـ👑ـ👑ـ👑ـ🪽ـمـ👑ـ👑ـ👑ـ🪽ـسـ👑ـ👑ـ👑ـ🪽ـكـ👑`, threadID);
    }, 15 * 1000);

    global.engineIntervals.set(threadID, interval);
  } else {
    return api.sendMessage("⚠️ الاستخدام: !توسيع المحال [on/off]", threadID);
  }
};
